<?php

namespace Zarbinco\PersianSearch\Query;

final class WindowsPersianKeyboardMap
{
    /** @return array<string, string> */
    public function map(): array
    {
        return [
            'q' => 'ض', 'w' => 'ص', 'e' => 'ث', 'r' => 'ق', 't' => 'ف',
            'y' => 'غ', 'u' => 'ع', 'i' => 'ه', 'o' => 'خ', 'p' => 'ح',
            '[' => 'ج', ']' => 'چ', '\\' => 'پ',
            'a' => 'ش', 's' => 'س', 'd' => 'ی', 'f' => 'ب', 'g' => 'ل',
            'h' => 'ا', 'j' => 'ت', 'k' => 'ن', 'l' => 'م', ';' => 'ک', "'" => 'گ',
            'z' => 'ظ', 'x' => 'ط', 'c' => 'ز', 'v' => 'ر', 'b' => 'ذ',
            'n' => 'د', 'm' => 'ئ', ',' => 'و', '.' => '.', '/' => '/',

            'A' => 'َ', 'B' => 'إ', 'C' => 'ژ', 'D' => 'ِ', 'E' => 'ٍ',
            'F' => 'ّ', 'G' => 'ۀ', 'H' => 'آ', 'I' => ']', 'J' => 'ـ',
            'K' => '«', 'L' => '»', 'M' => 'ء', 'N' => 'أ', 'O' => '[',
            'P' => '\\', 'Q' => 'ً', 'R' => 'ریال', 'S' => 'ُ', 'T' => '،',
            'U' => ',', 'V' => 'ؤ', 'W' => 'ٌ', 'X' => 'ي', 'Y' => '؛', 'Z' => 'ة',
            '?' => '؟', '{' => '}', '}' => '{', '`' => '÷', '~' => '×',
        ];
    }
}
